app/views/bars/index.html.erb


	<% if bar.pass_sets.empty? %>
---
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."bar_id" = 3
SELECT COUNT(*) FROM "pass_sets" WHERE "pass_sets"."bar_id" = 2