app/views/users/show.html.erb

SELECT "bars".* FROM "bars" WHERE "bars"."user_id" = 2
SELECT COUNT(*) FROM "bars" WHERE "bars"."user_id" = 5
---
<p>Partner Status: <%=@user.partner %></p>
<p># of Bar Locations: <%=@user.bars.count %></p>