app/views/pass_sets/show.html.erb

  	<div class="controls">
	  <%= f.select :num_passes, (1..5) %>
---
SELECT "passes".* FROM "passes" WHERE "passes"."pass_set_id" = 1