app/controllers/admin_controller.rb

  def index
  @numOfCustomers= User.where("partner = 'f' AND admin='f'").count('email', :distinct => true)
---
SELECT COUNT(DISTINCT "users"."email") FROM "users" WHERE (partner = 'f' AND admin='f')

  def customers
   @customers = User.where("partner = 'f' AND admin='f'").order(:email).paginate(:page => params[:page], :per_page => 10)
---
SELECT "users".* FROM "users" WHERE (partner = 'f' AND admin='f') ORDER BY email LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (partner = 'f' AND admin='f')

  def partners
  @partners = User.where("partner = 't'").order(:email).paginate(:page => params[:page], :per_page => 10)
---
SELECT "users".* FROM "users" WHERE (partner = 't') ORDER BY email LIMIT 10 OFFSET 0