app/controllers/bars_controller.rb

SELECT "bars".* FROM "bars"
---
  def index
	if current_user.partner?
	redirect_to action: :home
	else
    @bars = Bar.all

SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."bar_id" = 1 ORDER BY created_at
---
  def show
    @bar = Bar.find(params[:id])
    @pass_sets = @bar.pass_sets.order(:created_at)