app/controllers/bars_controller.rb

  def show
    @bar = Bar.find(params[:id])
	  @user = @bar.user
    @full_path = "http://#{request.host+request.fullpath}"
    @pass_sets = @bar.pass_sets.where("date >= ?", Date.today).order(:date)
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."bar_id" = 1 AND (date >= '2013-01-03') ORDER BY date

  def new
    @bar = Bar.new
	@user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def edit
    @bar = Bar.find(params[:id])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @bar = Bar.new(params[:bar])
	@bar.address = @bar.street_address + " , " + @bar.city + " , " + @bar.state + " , " + @bar.zip_code
	@user = User.find(params[:os])
	@bar.user = @user
	@bar.user_id= @user.id
    respond_to do |format|
      if @bar.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
INSERT INTO "bars" ("address", "city", "created_at", "facebook_url", "hourclose_friday", "hourclose_monday", "hourclose_saturday", "hourclose_sunday", "hourclose_thursday", "hourclose_tuesday", "hourclose_wednesday", "houropen_friday", "houropen_monday", "houropen_saturday", "houropen_sunday", "houropen_thursday", "houropen_tuesday", "houropen_wednesday", "intro_paragraph", "latitude", "logo", "longitude", "name", "open_friday", "open_monday", "open_saturday", "open_sunday", "open_thursday", "open_tuesday", "open_wednesday", "phone_number", "state", "street_address", "twitter_url", "updated_at", "user_id", "website_url", "zip_code") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

def search
  @search = params[:search]
  @bars = Bar.search(@search)
---
SELECT "bars".* FROM "bars" WHERE (name LIKE '%Ann Arbor, MI%')

  def update
    @bar = Bar.find(params[:id])
	@user = User.find(params[:os])
    @pass_set = @bar.pass_sets.first
	if(current_user.admin?)
    respond_to do |format|
      if @bar.update_attributes(params[:bar])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."bar_id" = 1 LIMIT 1
UPDATE "bars" SET "address" = '31645 Corte Padrera Temecula,CA92952', "latitude" = 33.508942, "longitude" = -117.106797, "updated_at" = '2012-12-17 20:04:02.665013' WHERE "bars"."id" = 1