app/controllers/current_user_controller.rb

  def delete_stripe_token
    logger.error "Stripe error while creating customer: #{current_user.stripe_customer_token}"
    current_user.update_attribute(:stripe_customer_token,nil)
---
UPDATE "users" SET "stripe_customer_token" = NULL, "updated_at" = '2012-12-13 22:35:00.421364' WHERE "users"."id" = 2

  def update
    @user = current_user
    current_user.save!
---
UPDATE "users" SET "stripe_customer_token" = 'cus_0uCcQO9jScQffr', "updated_at" = '2012-12-12 22:42:52.579130' WHERE "users"."id" = 2