app/controllers/pass_sets_controller.rb

  def show
    @bar = Bar.find(params[:bar_id])
    @pass_set = PassSet.find(params[:id])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @pass_set = PassSet.new
	@pass_set.sold_passes = 0
	@pass_set.unsold_passes = @pass_set.total_released_passes
    @bar = Bar.find(params[:bar_id])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @bar = Bar.find(params[:bar_id])
    @pass_set = PassSet.find(params[:id])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @pass_set = PassSet.new(params[:pass_set])
	@pass_set.sold_passes = 0
	@pass_set.unsold_passes = @pass_set.total_released_passes
    @bar = Bar.find(params[:bar_id])
    @pass_set.bar = @bar
	@existing_set = @bar.pass_sets.where("date = ?", @pass_set.date).first
    respond_to do |format|
		if @pass_set.date < Date.today
		flash[:notice] = 'Error: You are trying to create a pass for a date that has already passed!'
        format.html { render action: "new"  }
        format.json { render json: @pass_set.errors, status: :unprocessable_entity }
	elsif @existing_set
				flash[:notice] = 'Error: Please use edit to change existing passes'
				format.html { redirect_to edit_user_bar_pass_set_path(@bar.user, @bar, @existing_set) }
				format.json { render json: @pass_set.errors, status: :unprocessable_entity }
      elsif @pass_set.save
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."bar_id" = 1 AND (date = '2013-01-10') LIMIT 1
INSERT INTO "pass_sets" ("bar_id", "created_at", "date", "price", "sold_passes", "total_released_passes", "unsold_passes", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @bar = Bar.find(params[:bar_id])
    @pass_set = PassSet.find(params[:id])
	@date = Date.new(params[:pass_set]["date(1i)"].to_i,params[:pass_set]["date(2i)"].to_i,params[:pass_set]["date(3i)"].to_i)
	@existing_set = @bar.pass_sets.where("date = ?", @date).first
    respond_to do |format|
	if @date < Date.today
		flash[:notice] = 'Error: You are trying to edit a pass to a date that has already passed!'
	    format.html { render action: "edit" }
        format.json { render json: @pass_set.errors, status: :unprocessable_entity }
	elsif @existing_set
		flash[:notice] = 'Error: You are trying to edit a pass to a date that has already exists!'
	    format.html { render action: "edit" }
        format.json { render json: @pass_set.errors, status: :unprocessable_entity }
	elsif @pass_set.update_attributes(params[:pass_set])
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pass_sets" SET "price" = 5.0, "updated_at" = '2012-12-11 17:53:37.431623' WHERE "pass_sets"."id" = 2