app/controllers/passes_controller.rb

  def index
  	@user = current_user
  	@passes = @user.passes.order('updated_at DESC')
---
SELECT "passes".* FROM "passes" INNER JOIN "purchases" ON "passes"."purchase_id" = "purchases"."id" WHERE "purchases"."user_id" = 1 ORDER BY updated_at DESC