app/controllers/potential_customers_controller.rb

SELECT "potential_customers".* FROM "potential_customers"
---
  def index
    @potential_customers = PotentialCustomer.all

SELECT "potential_customers".* FROM "potential_customers" WHERE "potential_customers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @potential_customer = PotentialCustomer.find(params[:id])

INSERT INTO "potential_customers" ("city", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["city", nil], ["created_at", Thu, 28 Mar 2013 22:13:36 UTC +00:00], ["email", "sd"], ["updated_at", Thu, 28 Mar 2013 22:13:36 UTC +00:00]]
---
  def create
    @potential_customer = PotentialCustomer.new(params[:potential_customer])

    respond_to do |format|
      if @potential_customer.save