app/controllers/purchases_controller.rb

	def create
		@user = current_user
		@bar = Bar.find(params[:purchase][:bar])
		@pass_set = PassSet.find(params[:purchase][:pass_set])
		num_passes = params[:purchase][:num_passes].to_i
		if num_passes > @pass_set.unsold_passes
			flash[:error] = 'Not enough passes left'
			redirect_to [@bar,@pass_set]
			return
		end
		@purchase = Purchase.new(params[:purchase])
		@purchase.user_id = @user.id
		@purchase.date = params[:purchase][:date]

		logger.error "Stripe error while creating customer: #{@user.stripe_customer_token}"
		if @user.stripe_customer_token != nil
		  if @purchase.payment_return_customer(current_user)
		      @pass_set.sold_passes+=num_passes
		      @pass_set.unsold_passes-=num_passes
		      @pass_set.save
		      # for i in 0..num_passes-1
			      pass = Pass.new
			      pass.name = params[:purchase][:name]
			      pass.purchase_id = @purchase.id
			      pass.pass_set_id = @pass_set.id
			      pass.redeemed = false
				    pass.entries=num_passes
			      pass.save
---
SELECT "bars".* FROM "bars" WHERE "bars"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pass_sets".* FROM "pass_sets" WHERE "pass_sets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "pass_sets" SET "sold_passes" = 1, "unsold_passes" = 49, "updated_at" = '2012-11-26 19:20:55.063701' WHERE "pass_sets"."id" = 1
INSERT INTO "passes" ("confirmation", "created_at", "entries", "name", "pass_set_id", "price", "purchase_id", "redeemed", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "purchases" ("created_at", "date", "stripe_card_token", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 26 Nov 2012 19:20:54 UTC +00:00], ["date", Sun, 10 Oct 2010], ["stripe_card_token", nil], ["updated_at", Mon, 26 Nov 2012 19:20:54 UTC +00:00], ["user_id", 1]]

		      redirect_to [@bar,@pass_set], notice: 'Purchase NOT Created'
		  end
		elsif params[:credit_card_save] == "1"
		  if @purchase.save_with_payment(current_user)
---
UPDATE "users" SET "stripe_customer_token" = 'cus_0rZrH1SUXFcMtJ', "updated_at" = '2012-12-05 22:31:54.108939' WHERE "users"."id" = 1