app/controllers/users_controller.rb

UPDATE "users" SET "stripe_card_token" = 'tok_0utCPTLUvpo7oO', "stripe_customer_token" = 'cus_0utCgeHBQbml61', "updated_at" = '2012-12-14 18:43:11.932730' WHERE "users"."id" = 2
---
  def update
    @user = User.new(params[:user])
    current_user.stripe_card_token = @user.stripe_card_token
    logger.error "Stripe error while creating customer: #{current_user.stripe_customer_token} and #{current_user.stripe_card_token}"
    if current_user.stripe_customer_token != nil
      current_user.save_token